# Реализуйте класс Matrix, представляющий матрицу и поддерживающий следующие операции:
#
# Инициализация матрицы. Конструктор класса должен принимать количество строк rows
# и количество столбцов cols и создавать матрицу с нулевыми значениями.
#
# Операция сложения матриц. Реализуйте метод __add__, который позволяет складывать две матрицы одинаковых размеров.
#
# Операция умножения матриц. Реализуйте метод __mul__, который позволяет умножать две матрицы с согласованными размерами
# (количество столбцов первой матрицы должно быть равно количеству строк второй матрицы).
#
# Сравнение матриц на равенство. Реализуйте метод __eq__, который позволяет сравнивать две матрицы на равенство.
#
# Представление матрицы в виде строки. Реализуйте метод __str__, который возвращает строковое представление матрицы,
# где элементы строки разделены пробелами, а строки сами разделены символами новой строки.
#
# Представление матрицы в виде строки для создания нового объекта. Реализуйте метод __repr__,
# который возвращает строку, которую можно использовать для создания нового объекта класса Matrix.

